In [5]:
import numpy as np
import pandas as pd
from sklearn.impute import SimpleImputer

In [29]:
df = pd.DataFrame({
    "Age":['5','40','35'],
    "Name":['Bhuvana','Nagesh','Lavanya'],
    "Company":[np.nan,'Oracle','SalesForce'],
    "Class":['Second',np.nan, np.nan],
    "Student_id":['123',np.nan, np.nan]
}
)

In [31]:
df

  Age     Name     Company   Class Student_id
0   5  Bhuvana         NaN  Second        123
1  40   Nagesh      Oracle     NaN        NaN
2  35  Lavanya  SalesForce     NaN        NaN

In [35]:
df.isnull()

Age           3
Name          3
Company       3
Class         3
Student_id    3
dtype: int64